## DataFrame

In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series  #DataFrame and Series are classes in pandas(Starts with Capital letter)
#We have specifically imported DataFrame, So no need to use pd.DataFrames. Can use DataFrame directly.
#dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
#dframe

### Creating a data frame

In [2]:
# Reading a file
ex = pd.read_csv('Universities.csv')
ex.head(5)

       Univ State   SAT  Top10  Accept  SFRatio Expenses  GradRate
0     Brown    RI  1310     89      22       13   22,704        94
1   CalTech    CA  1415    100      25        6   63,575        81
2       CMU    PA  1260     62      59        9   25,026        72
3  Columbia    NY  1310     76      24       12   31,510        88
4   Cornell    NY  1280     83      33       13   21,864        90

In [3]:
# If you dont have aheader/ dont want to use 1st row as the header then
#Can specify no of rows you want to see
pd.read_csv('Universities.csv',header=None, nrows=3)

         0      1     2      3       4        5         6         7
0     Univ  State   SAT  Top10  Accept  SFRatio  Expenses  GradRate
1    Brown     RI  1310     89      22       13    22,704        94
2  CalTech     CA  1415    100      25        6    63,575        81

In [4]:
#3 rows with no headers
pd.read_csv('Universities.csv', nrows=3)

      Univ State   SAT  Top10  Accept  SFRatio Expenses  GradRate
0    Brown    RI  1310     89      22       13   22,704        94
1  CalTech    CA  1415    100      25        6   63,575        81
2      CMU    PA  1260     62      59        9   25,026        72

In [5]:
# if you want to use only few columns(Give a list of columns you need to use) not all then
pd.read_csv('Universities.csv',usecols=[1,2]).head(10)

  State   SAT
0    RI  1310
1    CA  1415
2    PA  1260
3    NY  1310
4    NY  1280
5    NH  1340
6    NC  1315
7    DC  1255
8    MA  1400
9    MD  1305

## Numpy
### Using Numpy in DataFrames

In [6]:
#Numpy is used for the multi dimentional data as an array
# we will be dealing with the tabular data so numpy usage is minimal.

In [7]:
#Creating an array(Matrix)
arr = np.array([[1,2,3],[4,5,6]])
arr

array([[1, 2, 3],
       [4, 5, 6]])

In [8]:
#Creating a data frame from a numpy array/ array
df = pd.DataFrame(data= arr, index= [1,2], columns = ['c1','c2','c3'])
df

   c1  c2  c3
1   1   2   3
2   4   5   6

In [9]:
# Creating a range of values using numpy
np.arange(9)

array([0, 1, 2, 3, 4, 5, 6, 7, 8])

In [10]:
#Reshaping the values matrix form
np.arange(9).reshape(3,3)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [11]:
#Creating a data from using the above matrix
dframe1 = pd.DataFrame(data= np.arange(9).reshape(3,3) , index = ['SF','LA','NY'], columns= ['pop','size','year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [12]:
#np.arange(Start, end, Dtype)
np.arange(1,10).reshape(3,3)

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

### DataFrames using Dictionaries

In [13]:
dict_frame = pd.DataFrame({'col1': [1,2,3], 'col2': [4,5,6]})
dict_frame

   col1  col2
0     1     4
1     2     5
2     3     6

In [14]:
# list of all columns
ex.columns

Index(['Univ', 'State', 'SAT', 'Top10', 'Accept', 'SFRatio', 'Expenses',
       'GradRate'],
      dtype='object')

In [15]:
ex.head(5)

       Univ State   SAT  Top10  Accept  SFRatio Expenses  GradRate
0     Brown    RI  1310     89      22       13   22,704        94
1   CalTech    CA  1415    100      25        6   63,575        81
2       CMU    PA  1260     62      59        9   25,026        72
3  Columbia    NY  1310     76      24       12   31,510        88
4   Cornell    NY  1280     83      33       13   21,864        90

In [16]:
#Accessing the column, Can use .(dot method)- Wont be useful if there are spaces in the column name(eg.matches 1)
# or we can use []- prefered.
#ex.SAT
ex['SAT'].head(3)

0    1310
1    1415
2    1260
Name: SAT, dtype: int64

In [17]:
# can see multiple columns using []
ex[['Univ','SAT']].head(10)

           Univ   SAT
0         Brown  1310
1       CalTech  1415
2           CMU  1260
3      Columbia  1310
4       Cornell  1280
5     Dartmouth  1340
6          Duke  1315
7    Georgetown  1255
8       Harvard  1400
9  JohnsHopkins  1305

In [18]:
#Checking a condition in a column
ex['SAT'] > 1300

0      True
1      True
2     False
3      True
4     False
5      True
6      True
7     False
8      True
9      True
10     True
11    False
12    False
13    False
14     True
15    False
16     True
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24     True
Name: SAT, dtype: bool

In [19]:
# If you want to see the data, We need to pass the information into the data frame
#Checking the values by giving the condition. It will return the values which meet the condition we specified.
ex[ex['SAT'] >1300]

            Univ State   SAT  Top10  Accept  SFRatio Expenses  GradRate
0          Brown    RI  1310     89      22       13   22,704        94
1        CalTech    CA  1415    100      25        6   63,575        81
3       Columbia    NY  1310     76      24       12   31,510        88
5      Dartmouth    NH  1340     89      23       10   32,162        95
6           Duke    NC  1315     90      30       12   31,585        95
8        Harvard    MA  1400     91      14       11   39,525        97
9   JohnsHopkins    MD  1305     75      44        7   58,691        87
10           MIT    MA  1380     94      30       10   34,870        91
14     Princeton    NJ  1375     91      14        8   30,220        95
16      Stanford    CA  1360     90      20       12   36,450        93
24          Yale    CT  1375     95      19       11   43,514        96

In [20]:
#adding a column with default value
# adding at the end
ex['college'] = 'College'
ex.head(3)

      Univ State   SAT  Top10  Accept  SFRatio Expenses  GradRate  college
0    Brown    RI  1310     89      22       13   22,704        94  College
1  CalTech    CA  1415    100      25        6   63,575        81  College
2      CMU    PA  1260     62      59        9   25,026        72  College

### Dropping a row or a column

In [21]:
dframe1 = pd.DataFrame(data= np.arange(9).reshape(3,3) , index = ['SF','LA','NY'], columns= ['pop','size','year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [22]:
#axis= 0- Refreing a row, by default it take as axis=0 if nothing given
#axis= 1- refering a column
#Droping a row
dframe1.drop('LA')

    pop  size  year
SF    0     1     2
NY    6     7     8

In [23]:
# Dropping a column
dframe1.drop('year', axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

### Adding within the data set

In [24]:
arr = np.array([[1,2,3],[4,15,1],[11,12,13]])
df2 = pd.DataFrame(arr, index= [1,2,3],columns= ['c1','c2','c3'])
df2

   c1  c2  c3
1   1   2   3
2   4  15   1
3  11  12  13

In [25]:
# summ of all the values- combine values in each column- Cloumn wise sum

In [26]:
df2.sum(axis=1)

1     6
2    20
3    36
dtype: int64

In [27]:
#Sum of all rows in each column
df2.sum()

c1    16
c2    29
c3    17
dtype: int64

In [28]:
# finding a min value in the columns
df2.min(axis=1)

1     1
2     1
3    11
dtype: int32

In [29]:
#Find the max in each row
df2.max()

c1    11
c2    15
c3    13
dtype: int32

In [30]:
# finding the index position of min value accros the columns
df2.idxmin(axis=1)

1    c1
2    c3
3    c1
dtype: object

In [31]:
#max location row wise
df2.idxmax()

c1    3
c2    2
c3    3
dtype: int64

In [32]:
# Cumulative sum- acorss cloumns
df2.cumsum(axis=1)

   c1  c2  c3
1   1   3   6
2   4  19  20
3  11  23  36

In [33]:
# Cumulative sum- accorss rows
df2.cumsum(axis=0)

   c1  c2  c3
1   1   2   3
2   5  17   4
3  16  29  17

## Summary statistics

In [34]:
# first thing we do when we start analysis
df.describe()

            c1       c2       c3
count  2.00000  2.00000  2.00000
mean   2.50000  3.50000  4.50000
std    2.12132  2.12132  2.12132
min    1.00000  2.00000  3.00000
25%    1.75000  2.75000  3.75000
50%    2.50000  3.50000  4.50000
75%    3.25000  4.25000  5.25000
max    4.00000  5.00000  6.00000

## Missing Data

In [35]:
#We have specifically imported DataFrame, So no need to use pd.DataFrames
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [36]:
new_dframe = dframe.dropna()
new_dframe

     0    1    2
0  1.0  2.0  3.0

In [37]:
# to drop the row with nan, Use how='all'

In [38]:
dframe.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [39]:
dframe3 = DataFrame([[1,2,3,4],[np.nan,5,6,11],[7,np.nan,9,10],[np.nan,np.nan,np.nan,33]])
dframe3

     0    1    2   3
0  1.0  2.0  3.0   4
1  NaN  5.0  6.0  11
2  7.0  NaN  9.0  10
3  NaN  NaN  NaN  33

In [40]:
dframe3.dropna(axis=1)

    3
0   4
1  11
2  10
3  33

In [41]:
#Remove the rows if atleat 2 values are not there, Max threshold is 2.
dframe3.dropna(thresh=2)

     0    1    2   3
0  1.0  2.0  3.0   4
1  NaN  5.0  6.0  11
2  7.0  NaN  9.0  10

In [42]:
# Filling the null values with some value
dframe3.fillna(111)

       0      1      2   3
0    1.0    2.0    3.0   4
1  111.0    5.0    6.0  11
2    7.0  111.0    9.0  10
3  111.0  111.0  111.0  33

In [43]:
# can fill the diffrent values for the different columns
dframe3.fillna({0:10,1:20,2:30,3:40})

      0     1     2   3
0   1.0   2.0   3.0   4
1  10.0   5.0   6.0  11
2   7.0  20.0   9.0  10
3  10.0  20.0  30.0  33

In [44]:
# it wont save the original data frame if we use fillna or dropna
# To make changes to the original data frame we use inpalce =True
dframe3.fillna({0:100},inplace=True)

In [45]:
dframe3

       0    1    2   3
0    1.0  2.0  3.0   4
1  100.0  5.0  6.0  11
2    7.0  NaN  9.0  10
3  100.0  NaN  NaN  33

In [46]:
# all nulls relace with 0
dframe3.fillna(0,inplace=True)

In [47]:
dframe3

       0    1    2   3
0    1.0  2.0  3.0   4
1  100.0  5.0  6.0  11
2    7.0  0.0  9.0  10
3  100.0  0.0  0.0  33

## Merge data

In [48]:
movies = DataFrame({'movieid':[1,2,3,4,5],'title':['T1','T2','T3','T4','T5']})
movies

   movieid title
0        1    T1
1        2    T2
2        3    T3
3        4    T4
4        5    T5

In [49]:
members = DataFrame({'memid':[1,2,3,4],'name':['Tom','John','Aron','Bobby'],'movieid':[1,3,4,np.nan]})
members

   memid   name  movieid
0      1    Tom      1.0
1      2   John      3.0
2      3   Aron      4.0
3      4  Bobby      NaN

In [50]:
# this is equalent to koin two tables(inner join(Common columns), left join(all left and common form right will be selected), 
#right join(all right and common form left will be selected), outer join(all records))
# at least one common column shold be same in both dataframes to merge

In [51]:
#inner join- balsed on the common values in a given column
#defult is inner
#pd.merge(movies,members)
#pd.merge(movies,members,how='inner')
pd.merge(movies,members,on='movieid')

   movieid title  memid  name
0        1    T1      1   Tom
1        3    T3      2  John
2        4    T4      3  Aron

In [52]:
#left join- all left + Common records from right
pd.merge(movies,members,how = 'left')

   movieid title  memid  name
0        1    T1    1.0   Tom
1        2    T2    NaN   NaN
2        3    T3    2.0  John
3        4    T4    3.0  Aron
4        5    T5    NaN   NaN

In [53]:
#Right join- all right + Common records from left
pd.merge(movies,members,how='right')

   movieid title  memid   name
0      1.0    T1      1    Tom
1      3.0    T3      2   John
2      4.0    T4      3   Aron
3      NaN   NaN      4  Bobby

In [54]:
#Outer join(All record from all dframes)
pd.merge(movies,members,on= 'movieid',how = 'outer')

   movieid title  memid   name
0      1.0    T1    1.0    Tom
1      2.0    T2    NaN    NaN
2      3.0    T3    2.0   John
3      4.0    T4    3.0   Aron
4      5.0    T5    NaN    NaN
5      NaN   NaN    4.0  Bobby

In [55]:
#Only set of columns you want then you can choose few
pd.merge(movies,members,how='right')[['memid','name','title']]

   memid   name title
0      1    Tom    T1
1      2   John    T3
2      3   Aron    T4
3      4  Bobby   NaN

## Handelling Duplicates

In [56]:
#creating a data frame using dictionary
ddup = DataFrame({'col1': ['A','A','B','B','B',], 'col2': [2,2,2,3,3]})
ddup

  col1  col2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [58]:
# using duplicated we can see the duplicate rows
ddup.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [61]:
#We can drop the duplcate rows
ddup.drop_duplicates()

  col1  col2
0    A     2
2    B     2
3    B     3

In [62]:
#It will keep the fist instace of the duplicate row and removed other duplicate rows.
#If we want we can remove all instances except the last one 

ddup.drop_duplicates(keep='last')

  col1  col2
1    A     2
2    B     2
4    B     3

In [63]:
# can drop the duplicates in a column as well, based on the coulm value it will remove
ddup.drop_duplicates(subset='col1')

  col1  col2
0    A     2
2    B     2

## Group By

In [66]:
dgrp = pd.read_csv('train.csv')
dgrp.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [71]:
#using group by functio, it will group by given value
# it cannot be directly printed, It is an iterable object
#Grouping based on Embarked column
grp = dgrp.groupby('Embarked')
grp

In [78]:
#Embarked and group(rest of the groped valued based on embarked)
#can take required columns if all are not required
for Embarked,group in grp:
    print (Embarked,group[['Name', 'Sex', 'Age']])

C                                                   Name     Sex   Age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0
19                             Masselmani, Mrs. Fatima  female   NaN
26                             Emir, Mr. Farred Chehab    male   NaN
30                            Uruchurtu, Don. Manuel E    male  40.0
..                                                 ...     ...   ...
866                       Duran y More, Miss. Asuncion  female  27.0
874              Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0
889                              Behr, Mr. Karl Howell    male  26.0

[168 rows x 3 columns]
Q                                      Name     Sex   Age
5                        Moran, Mr. James    male   NaN
16                   Rice, Master. Eugene    male   2.0
22            McGowan, Miss. Anna "Annie"  female  15.0
28          O'Dwyer, Miss. Ellen "Nellie"  female   NaN
32               Glynn, Miss. Mary Agatha  female   NaN
..                                    ...     ...   ...
790              Keane, Mr. Andrew "Andy"    male   NaN
825                       Flynn, Mr. John    male   NaN
828          McCormack, Mr. Thomas Joseph    male   NaN
885  Rice, Mrs. William (Margaret Norton)  female  39.0
890                   Dooley, Mr. Patrick    male  32.0

[77 rows x 3 columns]
S                                              Name     Sex   Age
0                         Braund, Mr. Owen Harris    male  22.0
2                          Heikkinen, Miss. Laina  female  26.0
3    Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                        Allen, Mr. William Henry    male  35.0
6                         McCarthy, Mr. Timothy J    male  54.0
..                                            ...     ...   ...
883                 Banfield, Mr. Frederick James    male  28.0
884                        Sutehall, Mr. Henry Jr    male  25.0
886                         Montvila, Rev. Juozas    male  27.0
887                  Graham, Miss. Margaret Edith  female  19.0
888      Johnston, Miss. Catherine Helen "Carrie"  female   NaN

[644 rows x 3 columns]

In [80]:
#Can get the a perticular group also
# getting group values based on the Embarked column and value C
grp.get_group('C')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN
...,...,...,...,...,...,...,...,...,...,...,...
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148

In [84]:
# Group by can be used for two cloumn- first it will group by 1st column then it will regroup by 2nd column inside that first group
grp2  = dgrp.groupby(['Embarked','Sex'])
grp2

In [85]:
for Embarked, group in grp2:
    print(Embarked,group)

('C', 'female')      PassengerId  Survived  Pclass  \
1              2         1       1
9             10         1       2
19            20         1       3
31            32         1       1
39            40         1       3
..           ...       ...     ...
858          859         1       3
866          867         1       2
874          875         1       2
875          876         1       3
879          880         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
19                             Masselmani, Mrs. Fatima  female   NaN      0
31      Spencer, Mrs. William Augustus (Marie Eugenie)  female   NaN      1
39                         Nicola-Yarred, Miss. Jamila  female  14.0      1
..                                                 ...     ...   ...    ...
858              Baclini, Mrs. Solomon (Latifa Qurban)  female  24.0      0
866                       Duran y More, Miss. Asuncion  female  27.0      1
874              Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0      1
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0

     Parch         Ticket      Fare Cabin Embarked
1        0       PC 17599   71.2833   C85        C
9        0         237736   30.0708   NaN        C
19       0           2649    7.2250   NaN        C
31       0       PC 17569  146.5208   B78        C
39       0           2651   11.2417   NaN        C
..     ...            ...       ...   ...      ...
858      3           2666   19.2583   NaN        C
866      0  SC/PARIS 2149   13.8583   NaN        C
874      0      P/PP 3381   24.0000   NaN        C
875      0           2667    7.2250   NaN        C
879      1          11767   83.1583   C50        C

[73 rows x 12 columns]
('C', 'male')      PassengerId  Survived  Pclass                        Name   Sex   Age  \
26            27         0       3     Emir, Mr. Farred Chehab  male   NaN
30            31         0       1    Uruchurtu, Don. Manuel E  male  40.0
34            35         0       1     Meyer, Mr. Edgar Joseph  male  28.0
36            37         1       3            Mamee, Mr. Hanna  male   NaN
42            43         0       3         Kraeff, Mr. Theodor  male   NaN
..           ...       ...     ...                         ...   ...   ...
839          840         1       1        Marechal, Mr. Pierre  male   NaN
843          844         0       3  Lemberopolous, Mr. Peter L  male  34.5
847          848         0       3          Markoff, Mr. Marin  male  35.0
859          860         0       3            Razi, Mr. Raihed  male   NaN
889          890         1       1       Behr, Mr. Karl Howell  male  26.0

     SibSp  Parch    Ticket     Fare Cabin Embarked
26       0      0      2631   7.2250   NaN        C
30       0      0  PC 17601  27.7208   NaN        C
34       1      0  PC 17604  82.1708   NaN        C
36       0      0      2677   7.2292   NaN        C
42       0      0    349253   7.8958   NaN        C
..     ...    ...       ...      ...   ...      ...
839      0      0     11774  29.7000   C47        C
843      0      0      2683   6.4375   NaN        C
847      0      0    349213   7.8958   NaN        C
859      0      0      2629   7.2292   NaN        C
889      0      0    111369  30.0000  C148        C

[95 rows x 12 columns]
('Q', 'female')      PassengerId  Survived  Pclass  \
22            23         1       3
28            29         1       3
32            33         1       3
44            45         1       3
47            48         1       3
82            83         1       3
109          110         1       3
156          157         1       3
186          187         1       3
198          199         1       3
208          209         1       3
241          242         1       3
264          265         0       3
274          275         1       3
289          290         1       3
300          301         1       3
303          304         1       2
322          323         1       2
330          331         1       3
358          359         1       3
359          360         1       3
368          369         1       3
412          413         1       1
501          502         0       3
502          503         0       3
573          574         1       3
593          594         0       3
612          613         1       3
653          654         1       3
654          655         0       3
657          658         0       3
680          681         0       3
697          698         1       3
727          728         1       3
767          768         0       3
885          886         0       3

                                                Name     Sex   Age  SibSp  \
22                       McGowan, Miss. Anna "Annie"  female  15.0      0
28                     O'Dwyer, Miss. Ellen "Nellie"  female   NaN      0
32                          Glynn, Miss. Mary Agatha  female   NaN      0
44                     Devaney, Miss. Margaret Delia  female  19.0      0
47                         O'Driscoll, Miss. Bridget  female   NaN      0
82                    McDermott, Miss. Brigdet Delia  female   NaN      0
109                              Moran, Miss. Bertha  female   NaN      1
156                 Gilnagh, Miss. Katherine "Katie"  female  16.0      0
186  O'Brien, Mrs. Thomas (Johanna "Hannah" Godfrey)  female   NaN      1
198                 Madigan, Miss. Margaret "Maggie"  female   NaN      0
208                        Carr, Miss. Helen "Ellen"  female  16.0      0
241                   Murphy, Miss. Katherine "Kate"  female   NaN      1
264                               Henry, Miss. Delia  female   NaN      0
274                       Healy, Miss. Hanora "Nora"  female   NaN      0
289                             Connolly, Miss. Kate  female  22.0      0
300         Kelly, Miss. Anna Katherine "Annie Kate"  female   NaN      0
303                              Keane, Miss. Nora A  female   NaN      0
322                        Slayter, Miss. Hilda Mary  female  30.0      0
330                               McCoy, Miss. Agnes  female   NaN      2
358                             McGovern, Miss. Mary  female   NaN      0
359                Mockler, Miss. Helen Mary "Ellie"  female   NaN      0
368                              Jermyn, Miss. Annie  female   NaN      0
412                           Minahan, Miss. Daisy E  female  33.0      1
501                              Canavan, Miss. Mary  female  21.0      0
502                   O'Sullivan, Miss. Bridget Mary  female   NaN      0
573                                Kelly, Miss. Mary  female   NaN      0
593                               Bourke, Miss. Mary  female   NaN      0
612                      Murphy, Miss. Margaret Jane  female   NaN      1
653                    O'Leary, Miss. Hanora "Norah"  female   NaN      0
654                     Hegarty, Miss. Hanora "Nora"  female  18.0      0
657                    Bourke, Mrs. John (Catherine)  female  32.0      1
680                              Peters, Miss. Katie  female   NaN      0
697                 Mullens, Miss. Katherine "Katie"  female   NaN      0
727                         Mannion, Miss. Margareth  female   NaN      0
767                               Mangan, Miss. Mary  female  30.5      0
885             Rice, Mrs. William (Margaret Norton)  female  39.0      0

     Parch  Ticket     Fare Cabin Embarked
22       0  330923   8.0292   NaN        Q
28       0  330959   7.8792   NaN        Q
32       0  335677   7.7500   NaN        Q
44       0  330958   7.8792   NaN        Q
47       0   14311   7.7500   NaN        Q
82       0  330932   7.7875   NaN        Q
109      0  371110  24.1500   NaN        Q
156      0   35851   7.7333   NaN        Q
186      0  370365  15.5000   NaN        Q
198      0  370370   7.7500   NaN        Q
208      0  367231   7.7500   NaN        Q
241      0  367230  15.5000   NaN        Q
264      0  382649   7.7500   NaN        Q
274      0  370375   7.7500   NaN        Q
289      0  370373   7.7500   NaN        Q
300      0    9234   7.7500   NaN        Q
303      0  226593  12.3500  E101        Q
322      0  234818  12.3500   NaN        Q
330      0  367226  23.2500   NaN        Q
358      0  330931   7.8792   NaN        Q
359      0  330980   7.8792   NaN        Q
368      0   14313   7.7500   NaN        Q
412      0   19928  90.0000   C78        Q
501      0  364846   7.7500   NaN        Q
502      0  330909   7.6292   NaN        Q
573      0   14312   7.7500   NaN        Q
593      2  364848   7.7500   NaN        Q
612      0  367230  15.5000   NaN        Q
653      0  330919   7.8292   NaN        Q
654      0  365226   6.7500   NaN        Q
657      1  364849  15.5000   NaN        Q
680      0  330935   8.1375   NaN        Q
697      0   35852   7.7333   NaN        Q
727      0   36866   7.7375   NaN        Q
767      0  364850   7.7500   NaN        Q
885      5  382652  29.1250   NaN        Q
('Q', 'male')      PassengerId  Survived  Pclass                            Name   Sex  \
5              6         0       3                Moran, Mr. James  male
16            17         0       3            Rice, Master. Eugene  male
46            47         0       3               Lennon, Mr. Denis  male
116          117         0       3            Connors, Mr. Patrick  male
126          127         0       3             McMahon, Mr. Martin  male
143          144         0       3             Burke, Mr. Jeremiah  male
171          172         0       3            Rice, Master. Arthur  male
188          189         0       3                Bourke, Mr. John  male
196          197         0       3             Mernagh, Mr. Robert  male
214          215         0       3             Kiernan, Mr. Philip  male
245          246         0       1     Minahan, Dr. William Edward  male
260          261         0       3               Smith, Mr. Thomas  male
278          279         0       3              Rice, Master. Eric  male
280          281         0       3                Duane, Mr. Frank  male
301          302         1       3              McCoy, Mr. Bernard  male
364          365         0       3             O'Brien, Mr. Thomas  male
388          389         0       3            Sadlier, Mr. Matthew  male
411          412         0       3                 Hart, Mr. Henry  male
421          422         0       3             Charters, Mr. David  male
428          429         0       3                Flynn, Mr. James  male
459          460         0       3           O'Connor, Mr. Maurice  male
468          469         0       3              Scanlan, Mr. James  male
510          511         1       3        Daly, Mr. Eugene Patrick  male
517          518         0       3               Ryan, Mr. Patrick  male
525          526         0       3              Farrell, Mr. James  male
552          553         0       3            O'Brien, Mr. Timothy  male
560          561         0       3        Morrow, Mr. Thomas Rowan  male
613          614         0       3                Horgan, Mr. John  male
626          627         0       2  Kirkland, Rev. Charles Leonard  male
629          630         0       3        O'Connell, Mr. Patrick D  male
703          704         0       3           Gallagher, Mr. Martin  male
718          719         0       3             McEvoy, Mr. Michael  male
749          750         0       3         Connaghton, Mr. Michael  male
768          769         0       3             Moran, Mr. Daniel J  male
776          777         0       3                Tobin, Mr. Roger  male
778          779         0       3         Kilgannon, Mr. Thomas J  male
787          788         0       3       Rice, Master. George Hugh  male
790          791         0       3        Keane, Mr. Andrew "Andy"  male
825          826         0       3                 Flynn, Mr. John  male
828          829         1       3    McCormack, Mr. Thomas Joseph  male
890          891         0       3             Dooley, Mr. Patrick  male

      Age  SibSp  Parch      Ticket     Fare Cabin Embarked
5     NaN      0      0      330877   8.4583   NaN        Q
16    2.0      4      1      382652  29.1250   NaN        Q
46    NaN      1      0      370371  15.5000   NaN        Q
116  70.5      0      0      370369   7.7500   NaN        Q
126   NaN      0      0      370372   7.7500   NaN        Q
143  19.0      0      0      365222   6.7500   NaN        Q
171   4.0      4      1      382652  29.1250   NaN        Q
188  40.0      1      1      364849  15.5000   NaN        Q
196   NaN      0      0      368703   7.7500   NaN        Q
214   NaN      1      0      367229   7.7500   NaN        Q
245  44.0      2      0       19928  90.0000   C78        Q
260   NaN      0      0      384461   7.7500   NaN        Q
278   7.0      4      1      382652  29.1250   NaN        Q
280  65.0      0      0      336439   7.7500   NaN        Q
301   NaN      2      0      367226  23.2500   NaN        Q
364   NaN      1      0      370365  15.5000   NaN        Q
388   NaN      0      0      367655   7.7292   NaN        Q
411   NaN      0      0      394140   6.8583   NaN        Q
421  21.0      0      0  A/5. 13032   7.7333   NaN        Q
428   NaN      0      0      364851   7.7500   NaN        Q
459   NaN      0      0      371060   7.7500   NaN        Q
468   NaN      0      0       36209   7.7250   NaN        Q
510  29.0      0      0      382651   7.7500   NaN        Q
517   NaN      0      0      371110  24.1500   NaN        Q
525  40.5      0      0      367232   7.7500   NaN        Q
552   NaN      0      0      330979   7.8292   NaN        Q
560   NaN      0      0      372622   7.7500   NaN        Q
613   NaN      0      0      370377   7.7500   NaN        Q
626  57.0      0      0      219533  12.3500   NaN        Q
629   NaN      0      0      334912   7.7333   NaN        Q
703  25.0      0      0       36864   7.7417   NaN        Q
718   NaN      0      0       36568  15.5000   NaN        Q
749  31.0      0      0      335097   7.7500   NaN        Q
768   NaN      1      0      371110  24.1500   NaN        Q
776   NaN      0      0      383121   7.7500   F38        Q
778   NaN      0      0       36865   7.7375   NaN        Q
787   8.0      4      1      382652  29.1250   NaN        Q
790   NaN      0      0       12460   7.7500   NaN        Q
825   NaN      0      0      368323   6.9500   NaN        Q
828   NaN      0      0      367228   7.7500   NaN        Q
890  32.0      0      0      370376   7.7500   NaN        Q
('S', 'female')      PassengerId  Survived  Pclass  \
2              3         1       3
3              4         1       1
8              9         1       3
10            11         1       3
11            12         1       1
..           ...       ...     ...
871          872         1       1
880          881         1       2
882          883         0       3
887          888         1       1
888          889         0       3

                                                  Name     Sex   Age  SibSp  \
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
10                     Sandstrom, Miss. Marguerite Rut  female   4.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
..                                                 ...     ...   ...    ...
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1

     Parch            Ticket     Fare Cabin Embarked
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
8        2            347742  11.1333   NaN        S
10       1           PP 9549  16.7000    G6        S
11       0            113783  26.5500  C103        S
..     ...               ...      ...   ...      ...
871      1             11751  52.5542   D35        S
880      1            230433  26.0000   NaN        S
882      0              7552  10.5167   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S

[203 rows x 12 columns]
('S', 'male')      PassengerId  Survived  Pclass                            Name   Sex  \
0              1         0       3         Braund, Mr. Owen Harris  male
4              5         0       3        Allen, Mr. William Henry  male
6              7         0       1         McCarthy, Mr. Timothy J  male
7              8         0       3  Palsson, Master. Gosta Leonard  male
12            13         0       3  Saundercock, Mr. William Henry  male
..           ...       ...     ...                             ...   ...
878          879         0       3              Laleff, Mr. Kristo  male
881          882         0       3              Markun, Mr. Johann  male
883          884         0       2   Banfield, Mr. Frederick James  male
884          885         0       3          Sutehall, Mr. Henry Jr  male
886          887         0       2           Montvila, Rev. Juozas  male

      Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0    22.0      1      0         A/5 21171   7.2500   NaN        S
4    35.0      0      0            373450   8.0500   NaN        S
6    54.0      0      0             17463  51.8625   E46        S
7     2.0      3      1            349909  21.0750   NaN        S
12   20.0      0      0         A/5. 2151   8.0500   NaN        S
..    ...    ...    ...               ...      ...   ...      ...
878   NaN      0      0            349217   7.8958   NaN        S
881  33.0      0      0            349257   7.8958   NaN        S
883  28.0      0      0  C.A./SOTON 34068  10.5000   NaN        S
884  25.0      0      0   SOTON/OQ 392076   7.0500   NaN        S
886  27.0      0      0            211536  13.0000   NaN        S

[441 rows x 12 columns]

In [92]:
#getting  group with the c values from Emarked and Male from Sex
grp2.get_group(('C','male'))

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin
26,27,0,3,"Emir, Mr. Farred Chehab",NaN,0,0,2631,7.2250,NaN
30,31,0,1,"Uruchurtu, Don. Manuel E",40.0,0,0,PC 17601,27.7208,NaN
34,35,0,1,"Meyer, Mr. Edgar Joseph",28.0,1,0,PC 17604,82.1708,NaN
36,37,1,3,"Mamee, Mr. Hanna",NaN,0,0,2677,7.2292,NaN
42,43,0,3,"Kraeff, Mr. Theodor",NaN,0,0,349253,7.8958,NaN
...,...,...,...,...,...,...,...,...,...,...
839,840,1,1,"Marechal, Mr. Pierre",NaN,0,0,11774,29.7000,C47
843,844,0,3,"Lemberopolous, Mr. Peter L",34.5,0,0,2683,6.4375,NaN
847,848,0,3,"Markoff, Mr. Marin",35.0,0,0,349213,7.8958,NaN
859,860,0,3,"Razi, Mr. Raihed",NaN,0,0,2629,7.2292,NaN
889,890,1,1,"Behr, Mr. Karl Howell",26.0,0,0,111369,30.0000,C148

## Rename columns of the dataframe

In [93]:
movies = DataFrame({'movieid':[1,2,3,4,5],'title':['T1','T2','T3','T4','T5']})
movies

   movieid title
0        1    T1
1        2    T2
2        3    T3
3        4    T4
4        5    T5

In [96]:
#Changing the movieid column name to mov_id
#use dictionary method
movies.rename(columns= {'movieid':'mov_id'})

   mov_id title
0       1    T1
1       2    T2
2       3    T3
3       4    T4
4       5    T5

## mapping

In [99]:
#it is no a functionality of dataframe but of sereies
#Create a data frame with states and then add the couln capitals map them based on the state names using a dictionary
dmap = DataFrame({'states':['kerala','karnataka','telangana','tamilnadu'], 'population':[1000,2000,3000,4000]})
dmap

      states  population
0     kerala        1000
1  karnataka        2000
2  telangana        3000
3  tamilnadu        4000

In [100]:
#Dictionary
capitals = {'kerala': 'trivendrum', 'telangana': 'hyderabad','karnataka':'bangalore','tamilnadu':'chennai'}
capitals

{'kerala': 'trivendrum',
 'telangana': 'hyderabad',
 'karnataka': 'bangalore',
 'tamilnadu': 'chennai'}

In [102]:
#creating a new column capital and do the mapping using dictionary
dmap['capitals'] = dmap['states'].map(capitals)
dmap

      states  population    capitals
0     kerala        1000  trivendrum
1  karnataka        2000   bangalore
2  telangana        3000   hyderabad
3  tamilnadu        4000     chennai